Суммы четвертей
Квадратная матрица разбивается на четыре четверти, ограниченные главной и побочной диагоналями: верхнюю, нижнюю, левую и правую.

Напишите программу, которая вычисляет сумму элементов: верхней четверти; правой четверти; нижней четверти; левой четверти.

Формат входных данных
На вход программе подаётся натуральное число n — количество строк и столбцов в матрице, затем элементы матрицы (целые числа) построчно через пробел.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.



# put your python code here
n = int(input())
a = [input().split() for i in range(n)]
count_V = 0
count_N = 0
count_P = 0
count_l = 0
for i in range(len(a)):
    for j in range(len(a)):
        a[i][j] = int(a[i][j])
        if i < j and i < n - 1 - j:
            count_V += a[i][j]
        if i < j and i > n - 1 - j:
            count_P += a[i][j]
        if i > j and i > n - 1 - j:
            count_N += a[i][j]
        if i > j and i < n - 1 - j:
            count_l += a[i][j]
            
print('Верхняя четверть:', count_V)
print('Правая четверть:', count_P)
print('Нижняя четверть:', count_N)
print('Левая четверть:', count_l)
